Revit 2027 API
MEPNetworkSegmentId(ElementId, Int32) Constructor
 Creates a valid segment id on the network.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPNetworkSegmentId(
	ElementId idElem,
	int segment
)
Public Sub New (
	idElem As ElementId,
	segment As Integer
)
public:
MEPNetworkSegmentId(
	ElementId^ idElem,
	int segment
)
new :
        idElem : ElementId *
        segment : int -> MEPNetworkSegmentId
Parameters
idElem ElementId
segment Int32
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPNetworkSegmentId Class
MEPNetworkSegmentId Overload
Autodesk.Revit.DB.Analysis Namespace